name: "mxnet-mdoel"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param {
    shape: { dim: 1 dim: 3 dim: 640 dim: 640 }
  }
}

layer {
  bottom: "data"
  top: "mobilenetv20_features_conv0"
  name: "mobilenetv20_features_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 8
    kernel_size: 3
    pad: 1
    group: 1
    stride: 2
    dilation: 1
    bias_term: false
  }
  param {
    name: "data"
  }
}

layer {
  bottom: "mobilenetv20_features_conv0"
  top: "mobilenetv20_features_batchnorm0"
  name: "mobilenetv20_features_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_batchnorm0"
  top: "mobilenetv20_features_batchnorm0"
  name: "mobilenetv20_features_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_batchnorm0"
  top: "mobilenetv20_features_relu60_relu6"
  name: "mobilenetv20_features_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck0_conv0"
  name: "mobilenetv20_features_linearbottleneck0_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 8
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck0_conv0"
  top: "mobilenetv20_features_linearbottleneck0_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck0_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck0_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck0_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck0_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck0_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck0_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck0_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck0_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck0_conv1"
  name: "mobilenetv20_features_linearbottleneck0_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 8
    kernel_size: 3
    pad: 1
    group: 8
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck0_conv1"
  top: "mobilenetv20_features_linearbottleneck0_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck0_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck0_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck0_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck0_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck0_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck0_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck0_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck0_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck0_conv2"
  name: "mobilenetv20_features_linearbottleneck0_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 4
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck0_conv2"
  top: "mobilenetv20_features_linearbottleneck0_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck0_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck0_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck0_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck0_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck0_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck1_conv0"
  name: "mobilenetv20_features_linearbottleneck1_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 24
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck1_conv0"
  top: "mobilenetv20_features_linearbottleneck1_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck1_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck1_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck1_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck1_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck1_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck1_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck1_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck1_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck1_conv1"
  name: "mobilenetv20_features_linearbottleneck1_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 24
    kernel_size: 3
    pad: 1
    group: 24
    stride: 2
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck1_conv1"
  top: "mobilenetv20_features_linearbottleneck1_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck1_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck1_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck1_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck1_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck1_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck1_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck1_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck1_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck1_conv2"
  name: "mobilenetv20_features_linearbottleneck1_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 6
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck1_conv2"
  top: "mobilenetv20_features_linearbottleneck1_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck1_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck1_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck1_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck1_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck1_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck2_conv0"
  name: "mobilenetv20_features_linearbottleneck2_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 36
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck2_conv0"
  top: "mobilenetv20_features_linearbottleneck2_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck2_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck2_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck2_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck2_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck2_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck2_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck2_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck2_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck2_conv1"
  name: "mobilenetv20_features_linearbottleneck2_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 36
    kernel_size: 3
    pad: 1
    group: 36
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck2_conv1"
  top: "mobilenetv20_features_linearbottleneck2_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck2_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck2_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck2_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck2_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck2_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck2_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck2_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck2_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck2_conv2"
  name: "mobilenetv20_features_linearbottleneck2_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 6
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck2_conv2"
  top: "mobilenetv20_features_linearbottleneck2_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck2_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck2_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck2_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck2_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "mobilenetv20_features_linearbottleneck2_elemwise_add0"
  type: "Eltwise"
  bottom: "mobilenetv20_features_linearbottleneck2_batchnorm2"
  bottom: "mobilenetv20_features_linearbottleneck1_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck2_elemwise_add0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck2_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck3_conv0"
  name: "mobilenetv20_features_linearbottleneck3_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 36
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck3_conv0"
  top: "mobilenetv20_features_linearbottleneck3_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck3_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck3_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck3_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck3_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck3_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck3_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck3_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck3_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck3_conv1"
  name: "mobilenetv20_features_linearbottleneck3_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 36
    kernel_size: 3
    pad: 1
    group: 36
    stride: 2
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck3_conv1"
  top: "mobilenetv20_features_linearbottleneck3_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck3_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck3_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck3_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck3_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck3_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck3_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck3_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck3_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck3_conv2"
  name: "mobilenetv20_features_linearbottleneck3_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 8
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck3_conv2"
  top: "mobilenetv20_features_linearbottleneck3_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck3_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck3_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck3_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck3_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck3_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck4_conv0"
  name: "mobilenetv20_features_linearbottleneck4_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 48
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck4_conv0"
  top: "mobilenetv20_features_linearbottleneck4_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck4_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck4_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck4_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck4_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck4_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck4_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck4_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck4_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck4_conv1"
  name: "mobilenetv20_features_linearbottleneck4_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 48
    kernel_size: 3
    pad: 1
    group: 48
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck4_conv1"
  top: "mobilenetv20_features_linearbottleneck4_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck4_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck4_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck4_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck4_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck4_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck4_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck4_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck4_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck4_conv2"
  name: "mobilenetv20_features_linearbottleneck4_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 8
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck4_conv2"
  top: "mobilenetv20_features_linearbottleneck4_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck4_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck4_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck4_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck4_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "mobilenetv20_features_linearbottleneck4_elemwise_add0"
  type: "Eltwise"
  bottom: "mobilenetv20_features_linearbottleneck4_batchnorm2"
  bottom: "mobilenetv20_features_linearbottleneck3_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck4_elemwise_add0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck4_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck5_conv0"
  name: "mobilenetv20_features_linearbottleneck5_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 48
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck5_conv0"
  top: "mobilenetv20_features_linearbottleneck5_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck5_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck5_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck5_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck5_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck5_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck5_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck5_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck5_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck5_conv1"
  name: "mobilenetv20_features_linearbottleneck5_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 48
    kernel_size: 3
    pad: 1
    group: 48
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck5_conv1"
  top: "mobilenetv20_features_linearbottleneck5_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck5_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck5_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck5_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck5_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck5_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck5_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck5_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck5_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck5_conv2"
  name: "mobilenetv20_features_linearbottleneck5_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 8
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck5_conv2"
  top: "mobilenetv20_features_linearbottleneck5_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck5_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck5_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck5_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck5_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "mobilenetv20_features_linearbottleneck5_elemwise_add0"
  type: "Eltwise"
  bottom: "mobilenetv20_features_linearbottleneck5_batchnorm2"
  bottom: "mobilenetv20_features_linearbottleneck4_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck5_elemwise_add0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck5_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck6_conv0"
  name: "mobilenetv20_features_linearbottleneck6_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 48
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck6_conv0"
  top: "mobilenetv20_features_linearbottleneck6_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck6_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck6_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck6_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck6_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck6_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck6_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck6_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck6_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck6_conv1"
  name: "mobilenetv20_features_linearbottleneck6_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 48
    kernel_size: 3
    pad: 1
    group: 48
    stride: 2
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck6_conv1"
  top: "mobilenetv20_features_linearbottleneck6_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck6_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck6_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck6_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck6_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck6_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck6_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck6_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck6_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck6_conv2"
  name: "mobilenetv20_features_linearbottleneck6_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 16
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck6_conv2"
  top: "mobilenetv20_features_linearbottleneck6_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck6_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck6_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck6_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck6_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck6_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck7_conv0"
  name: "mobilenetv20_features_linearbottleneck7_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 96
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck7_conv0"
  top: "mobilenetv20_features_linearbottleneck7_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck7_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck7_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck7_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck7_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck7_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck7_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck7_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck7_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck7_conv1"
  name: "mobilenetv20_features_linearbottleneck7_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 96
    kernel_size: 3
    pad: 1
    group: 96
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck7_conv1"
  top: "mobilenetv20_features_linearbottleneck7_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck7_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck7_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck7_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck7_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck7_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck7_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck7_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck7_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck7_conv2"
  name: "mobilenetv20_features_linearbottleneck7_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 16
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck7_conv2"
  top: "mobilenetv20_features_linearbottleneck7_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck7_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck7_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck7_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck7_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "mobilenetv20_features_linearbottleneck7_elemwise_add0"
  type: "Eltwise"
  bottom: "mobilenetv20_features_linearbottleneck7_batchnorm2"
  bottom: "mobilenetv20_features_linearbottleneck6_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck7_elemwise_add0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck7_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck8_conv0"
  name: "mobilenetv20_features_linearbottleneck8_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 96
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck8_conv0"
  top: "mobilenetv20_features_linearbottleneck8_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck8_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck8_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck8_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck8_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck8_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck8_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck8_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck8_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck8_conv1"
  name: "mobilenetv20_features_linearbottleneck8_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 96
    kernel_size: 3
    pad: 1
    group: 96
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck8_conv1"
  top: "mobilenetv20_features_linearbottleneck8_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck8_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck8_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck8_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck8_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck8_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck8_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck8_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck8_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck8_conv2"
  name: "mobilenetv20_features_linearbottleneck8_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 16
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck8_conv2"
  top: "mobilenetv20_features_linearbottleneck8_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck8_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck8_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck8_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck8_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "mobilenetv20_features_linearbottleneck8_elemwise_add0"
  type: "Eltwise"
  bottom: "mobilenetv20_features_linearbottleneck8_batchnorm2"
  bottom: "mobilenetv20_features_linearbottleneck7_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck8_elemwise_add0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck8_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck9_conv0"
  name: "mobilenetv20_features_linearbottleneck9_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 96
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck9_conv0"
  top: "mobilenetv20_features_linearbottleneck9_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck9_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck9_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck9_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck9_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck9_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck9_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck9_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck9_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck9_conv1"
  name: "mobilenetv20_features_linearbottleneck9_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 96
    kernel_size: 3
    pad: 1
    group: 96
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck9_conv1"
  top: "mobilenetv20_features_linearbottleneck9_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck9_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck9_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck9_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck9_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck9_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck9_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck9_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck9_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck9_conv2"
  name: "mobilenetv20_features_linearbottleneck9_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 16
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck9_conv2"
  top: "mobilenetv20_features_linearbottleneck9_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck9_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck9_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck9_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck9_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "mobilenetv20_features_linearbottleneck9_elemwise_add0"
  type: "Eltwise"
  bottom: "mobilenetv20_features_linearbottleneck9_batchnorm2"
  bottom: "mobilenetv20_features_linearbottleneck8_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck9_elemwise_add0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck9_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck10_conv0"
  name: "mobilenetv20_features_linearbottleneck10_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 96
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck10_conv0"
  top: "mobilenetv20_features_linearbottleneck10_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck10_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck10_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck10_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck10_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck10_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck10_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck10_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck10_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck10_conv1"
  name: "mobilenetv20_features_linearbottleneck10_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 96
    kernel_size: 3
    pad: 1
    group: 96
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck10_conv1"
  top: "mobilenetv20_features_linearbottleneck10_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck10_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck10_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck10_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck10_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck10_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck10_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck10_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck10_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck10_conv2"
  name: "mobilenetv20_features_linearbottleneck10_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 24
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck10_conv2"
  top: "mobilenetv20_features_linearbottleneck10_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck10_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck10_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck10_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck10_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck10_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck11_conv0"
  name: "mobilenetv20_features_linearbottleneck11_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 144
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck11_conv0"
  top: "mobilenetv20_features_linearbottleneck11_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck11_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck11_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck11_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck11_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck11_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck11_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck11_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck11_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck11_conv1"
  name: "mobilenetv20_features_linearbottleneck11_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 144
    kernel_size: 3
    pad: 1
    group: 144
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck11_conv1"
  top: "mobilenetv20_features_linearbottleneck11_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck11_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck11_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck11_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck11_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck11_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck11_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck11_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck11_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck11_conv2"
  name: "mobilenetv20_features_linearbottleneck11_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 24
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck11_conv2"
  top: "mobilenetv20_features_linearbottleneck11_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck11_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck11_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck11_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck11_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "mobilenetv20_features_linearbottleneck11_elemwise_add0"
  type: "Eltwise"
  bottom: "mobilenetv20_features_linearbottleneck11_batchnorm2"
  bottom: "mobilenetv20_features_linearbottleneck10_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck11_elemwise_add0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck11_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck12_conv0"
  name: "mobilenetv20_features_linearbottleneck12_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 144
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck12_conv0"
  top: "mobilenetv20_features_linearbottleneck12_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck12_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck12_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck12_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck12_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck12_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck12_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck12_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck12_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck12_conv1"
  name: "mobilenetv20_features_linearbottleneck12_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 144
    kernel_size: 3
    pad: 1
    group: 144
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck12_conv1"
  top: "mobilenetv20_features_linearbottleneck12_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck12_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck12_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck12_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck12_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck12_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck12_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck12_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck12_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck12_conv2"
  name: "mobilenetv20_features_linearbottleneck12_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 24
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck12_conv2"
  top: "mobilenetv20_features_linearbottleneck12_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck12_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck12_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck12_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck12_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  name: "mobilenetv20_features_linearbottleneck12_elemwise_add0"
  type: "Eltwise"
  bottom: "mobilenetv20_features_linearbottleneck12_batchnorm2"
  bottom: "mobilenetv20_features_linearbottleneck11_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck12_elemwise_add0"
  eltwise_param { operation: SUM }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck12_elemwise_add0"
  top: "mobilenetv20_features_linearbottleneck13_conv0"
  name: "mobilenetv20_features_linearbottleneck13_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 144
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck13_conv0"
  top: "mobilenetv20_features_linearbottleneck13_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck13_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck13_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck13_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck13_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck13_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck13_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck13_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck13_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck13_conv1"
  name: "mobilenetv20_features_linearbottleneck13_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 144
    kernel_size: 3
    pad: 1
    group: 144
    stride: 2
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck13_conv1"
  top: "mobilenetv20_features_linearbottleneck13_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck13_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck13_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck13_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck13_batchnorm1_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck13_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck13_relu61_relu6"
  name: "mobilenetv20_features_linearbottleneck13_relu61_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck13_relu61_relu6"
  top: "mobilenetv20_features_linearbottleneck13_conv2"
  name: "mobilenetv20_features_linearbottleneck13_conv2"
  type: "Convolution"
  convolution_param {
    num_output: 40
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck13_conv2"
  top: "mobilenetv20_features_linearbottleneck13_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck13_batchnorm2"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck13_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck13_batchnorm2"
  name: "mobilenetv20_features_linearbottleneck13_batchnorm2_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck13_batchnorm2"
  top: "mobilenetv20_features_linearbottleneck14_conv0"
  name: "mobilenetv20_features_linearbottleneck14_conv0"
  type: "Convolution"
  convolution_param {
    num_output: 240
    kernel_size: 1
    pad: 0
    group: 1
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck14_conv0"
  top: "mobilenetv20_features_linearbottleneck14_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck14_batchnorm0"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck14_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck14_batchnorm0"
  name: "mobilenetv20_features_linearbottleneck14_batchnorm0_scale"
  type: "Scale"
  scale_param { bias_term: true }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck14_batchnorm0"
  top: "mobilenetv20_features_linearbottleneck14_relu60_relu6"
  name: "mobilenetv20_features_linearbottleneck14_relu60_relu6"
  type: "ReLU"
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck14_relu60_relu6"
  top: "mobilenetv20_features_linearbottleneck14_conv1"
  name: "mobilenetv20_features_linearbottleneck14_conv1"
  type: "DepthwiseConvolution"
  convolution_param {
    num_output: 240
    kernel_size: 3
    pad: 1
    group: 240
    stride: 1
    dilation: 1
    bias_term: false
  }
}

layer {
  bottom: "mobilenetv20_features_linearbottleneck14_conv1"
  top: "mobilenetv20_features_linearbottleneck14_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck14_batchnorm1"
  type: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    moving_average_fraction: 0.9
    eps: 1e-05
  }
}
layer {
  bottom: "mobilenetv20_features_linearbottleneck14_batchnorm1"
  top: "mobilenetv20_features_linearbottleneck14_batchnorm1"
  name: "mobilenetv20_features_linearbottleneck14_batchnorm1_scale"
