#SSD with Mobilenet v1, configured for traffic Dataset.
# Users should configure the fine_tune_checkpoint field in the train config as
# well as the label_map_path and input_path fields in the train_input_reader and
# eval_input_reader. Search for "PATH_TO_BE_CONFIGURED" to find the fields that
# should be configured.
# TPU-compatible

model {
  ssd {
    num_classes: 1
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 2
        #min_scale: 0.2
        #max_scale: 0.95
        #aspect_ratios: 1.0
        #aspect_ratios: 2.0
        #aspect_ratios: 0.5
        #aspect_ratios: 3.0
        #aspect_ratios: 0.3333
        #min_scale: 0.7
        #max_scale: 0.9
        scales: [0.35, 0.5]
        scales: [0.2,0.35,0.5,0.65,0.8,0.95]
        aspect_ratios: [1.0]
        aspect_ratios: [1.0]
        #aspect_ratios: 1.0
        #aspect_ratios: 2.0
        #aspect_ratios: 0.5
      }
    }
    image_resizer {
      fixed_shape_resizer {
        #height: 224
        #width: 224
        height: 128
        width: 128
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.9997,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_blazenet_v1'
      min_depth: 16
      depth_multiplier: 1.0
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
    }
    loss {
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      classification_loss {
        weighted_sigmoid {
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.99
        loss_type: BOTH
        max_negatives_per_positive: 3
        min_negatives_per_image: 1
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.5
        max_detections_per_class: 50
        max_total_detections: 50
      }
      score_converter: SOFTMAX
    }
  }
}

train_config: {
  batch_size: 8
  num_batch_queue_threads: 1
  batch_queue_capacity: 2000
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.001
          decay_steps: 18750
          decay_factor: 0.5
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  fine_tune_checkpoint: "/home/zhangxindong/DMS/detector/pretrained_model/blazenet-v1/model.ckpt-29167"
  from_detection_checkpoint: true
  load_all_detection_checkpoint_vars: false
  # Note: The below line limits the training process to 200K steps, which we
  # empirically found to be sufficient enough to train the pets dataset. This
  # effectively bypasses the learning rate schedule (the learning rate will
  # never decay). Remove the below line to train indefinitely.
  num_steps: 200000
  data_augmentation_options {
    random_adjust_brightness{
    }
  }
  data_augmentation_options {
    random_image_scale {
    }
  }
  data_augmentation_options {
    random_jitter_boxes {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  max_number_of_boxes: 50
  unpad_groundtruth_tensors: false
}

train_input_reader: {
  tf_record_input_reader {
    input_path: "/home/zhangxindong/DMS/detector/data/face_det_train.tfrecords"
  }
  label_map_path: "/home/zhangxindong/DMS/detector/data/face_label_map.pbtxt"
  num_readers: 1
  prefetch_size: 256
  read_block_length: 32
}

eval_config: {
  num_examples: 1000
  # Note: The below line limits the evaluation process to 10 evaluations.
  # Remove the below line to evaluate indefinitely.
  visualization_export_dir: '/home/data/zhangxd/visualization'
  visualize_groundtruth_boxes: True
  min_score_threshold: 0.5
  num_visualizations: 100
  include_metrics_per_category: True
}

eval_input_reader: {
  tf_record_input_reader {
    input_path: "/home/zhangxindong/DMS/detector/data/face_det_test.tfrecords"
  }
  label_map_path: "/home/zhangxindong/DMS/detector/data/face_label_map.pbtxt"
  shuffle: false
  num_readers: 4
  prefetch_size: 128
  read_block_length: 32
}



